backend/n1mapp/app/controllers/api/v1/help_centers_controller.rb

SELECT "help_centers".* FROM "help_centers" ORDER BY name DESC
---
            def index
                hcenters = HelpCenter.order('name DESC');