backend/n1mapp/app/controllers/api/v1/users_controller.rb

            def create
                user = User.new(user_params)
                if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "admin_user") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

            def update
                user = User.find(params[:id])
                if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "attendant_phone_number" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["attendant_phone_number", "3135556677"], ["updated_at", "2018-10-02 15:05:59.056144"], ["id", 1]]