backend/n1mapp/app/controllers/aggression_details_controller.rb

SELECT "aggression_details".* FROM "aggression_details"
---
  def index
    @aggression_details = AggressionDetail.all

INSERT INTO "aggression_details" ("user_id", "perpetrator_name", "perpetrator_age", "perpetrator_gender", "relatioship", "live_together", "aggression_date", "aggression_time", "mechanism", "scene", "proof_file", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @aggression_detail = AggressionDetail.new(aggression_detail_params)

    respond_to do |format|
      if @aggression_detail.save

UPDATE "aggression_details" SET "aggression_date" = $1, "updated_at" = $2 WHERE "aggression_details"."id" = $3  [["aggression_date", "2014-09-18"], ["updated_at", "2018-09-14 03:09:08.702422"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @aggression_detail.update(aggression_detail_params)

SELECT  "aggression_details".* FROM "aggression_details" WHERE "aggression_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_aggression_detail
      @aggression_detail = AggressionDetail.find(params[:id])