backend/n1mapp/app/controllers/help_centers_controller.rb

  def index
    @help_centers = HelpCenter.all
---
SELECT "help_centers".* FROM "help_centers"

    def set_help_center
      @help_center = HelpCenter.find(params[:id])
---
SELECT  "help_centers".* FROM "help_centers" WHERE "help_centers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]